app/Http/Controllers/RSVPController.php

    public function store(Request $request)
    {
        $validated = $request->validate([
            'FirstName' => 'required|string|max:255',
            'LastName' => 'required|string|max:255',
            'email' => 'required|email|unique:rsvps|max:255',
            'number' => 'required|string|max:20',
            'Accept' => 'required|boolean',
        ]);

        try {
            RSVP::create($validated);
---
insert into `rsvps` (`FirstName`, `LastName`, `email`, `number`, `Accept`, `updated_at`, `created_at`) values ('Brix', 'Hernandez', 'mattbix55@gmail.com', '09174913077', '1', '2025-05-18 11:13:28', '2025-05-18 11:13:28')